{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Задачи на дом от 27 февраля\n",
    "## Выполнила студентка группы БСТ1901 Леонова Полина\n",
    "\n",
    "### Задание №1 \"Тридевятое царство\"\n",
    "В Тридевятом Царстве уже много лет как установилась конституционная монархия. В парламент Тридевятого царства входят 26 партий, обозначаемых строчными буквами английского алфавита от «a» до «z». Заседание парламента в соответствии с регламентом проходит по следующей схеме:\n",
    "\n",
    "● В начале заседания никаких законопроектов на повестке дня не стоит.\n",
    "\n",
    "● Любая партия (в том числе и та, которая внесла текущий законопроект) в любой момент времени может внести на обсуждение новый законопроект.\n",
    "\n",
    "● При вносе партией нового законопроекта обсуждение предыдущего приостанавливается и начинается обсуждение нового. После того, как парламентарии голосуют за новый законопроект, обсуждение законопроекта, прерванного им, продолжается.\n",
    "\n",
    "● Дискуссия по любому законопроекту обязана завершиться голосованием по этому законопроекту.\n",
    "\n",
    "● В конце заседания не должно остаться внесённых законопроектов, дискуссия по которым не завершена.\n",
    "\n",
    "Вам дана запись о событиях на сессии парламента. Каждое событие является либо внесением нового законопроекта, либо голосованием за какой-то законопроект, причём в обоих случаях известен номер партии, этот законопроект предложившей. События даны в том порядке, в котором они происходили. Проверьте, может ли данная запись о событиях соответствовать какому-либо заседанию, удовлетворяющему порядку проведения, описанному выше. \n",
    "\n",
    "##### Входные данные\n",
    "\n",
    "Первая строка входных данных содержит одно целое число K – количество строк в записи сессии (1 ≤ K ≤ 1000). Каждая строка соответствует одному из двух событий:\n",
    "\n",
    "● Add x – партия x внесла на голосование законопроект.\n",
    "\n",
    "● Vote x – прошло голосование за документ, внесённый партией x.\n",
    "\n",
    "Здесь x – строчная буква английского алфавита от «a» до «z», задающая партию.\n",
    "\n",
    "##### Вывод\n",
    "\n",
    "Выведите «Yes», если существует корректный порядок проведения заседания, который мог привести к такой записи, и «No», если ни при каком корректном порядке проведения заседания данная запись появиться не могла"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите количество событий в этот день\n",
      " ->3\n",
      "Введите событие\n",
      " ->Add x\n",
      "Введите событие\n",
      " ->Add y\n",
      "Введите событие\n",
      " ->Vote x\n",
      "No\n"
     ]
    }
   ],
   "source": [
    "def check(events):\n",
    "    stack = []\n",
    "    for e in events:\n",
    "        cmd, party = e.split()\n",
    "        if cmd == \"Add\":\n",
    "            stack.append(party)\n",
    "        elif cmd == \"Vote\":\n",
    "            if stack.pop() != party:\n",
    "                return \"No\"\n",
    "            \n",
    "    if len(stack) == 0:\n",
    "        return \"Yes\"\n",
    "    else:\n",
    "        return \"No\"\n",
    "\n",
    "K = int(input(\"Введите количество событий в этот день\\n ->\"))\n",
    "events = []\n",
    "for i in range(K):\n",
    "    events.append(input('Введите событие\\n ->'))\n",
    "print(check(events))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "\n",
    "### Задание №2 \"Правильный подмногоугольник\"\n",
    "\n",
    "Задан правильный N-угольник. Требуется выбрать наименьшее количество его вершин, которые также образуют правильный многоугольник.\n",
    "\n",
    "##### Входные данные\n",
    "\n",
    "Входные данные содержат одно целое число N (3 ≤ N ≤ 1012).\n",
    "\n",
    "##### Вывод\n",
    "\n",
    "Выведите одно число — наименьшее количество вершин заданного многоугольника, которые образуют правильный многоугольник.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "4"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def subpolygon(N):\n",
    "    for K in range(3, N//2+1):\n",
    "        if N % K == 0: \n",
    "            return K\n",
    "    return N\n",
    "\n",
    "subpolygon(16)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задание №3 \"Форум\"\n",
    "На форуме, на котором обсуждаются задачи олимпиад по информатике, ввели следующий аналог капчи. Участнику выдаётся строка из N десятичных цифр (без ведущих нулей). В качестве ответа требуется ввести такое основание системы счисления B, что в этой системе счисления выданная запись будет соответствовать составному числу (назовем его D), а также число X, большее 1 и меньшее D, являющееся делителем D.\n",
    "\n",
    "При этом B и X не должны превосходить 109.\n",
    "\n",
    "По заданной строке десятичных цифр найдите любую пару чисел B и X, удовлетворяющую ограничениям, или ответьте, что решения в заданных ограничениях не существует.\n",
    "\n",
    "##### Входные данные\n",
    "\n",
    "Входные данные состоят из непустой строки длиной до 3 ⋅ 106 символов, составленной из цифр от 0 до 9 и не начинающейся с 0.\n",
    "\n",
    "##### Вывод\n",
    "\n",
    "Если решение существует, выведите два числа – основание системы счисления B и делитель X, записанные в десятичной системе счисления. Оба числа должны удовлетворять ограничениям 2 ≤ B, X ≤ 109. Если решения не существует, выведите –1.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(10, 3)"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def captcha(s):\n",
    "    l = [0,0,0,2,0,2,0,2,3] #обработка для чисел 1-9\n",
    "    if len(s) == 1:\n",
    "        res = l[int(s)-1]\n",
    "        if res:\n",
    "            return 10, res\n",
    "        return -1\n",
    "    S = sum(map(int, s)) #map(int, \"251\") -> [2, 5, 1]\n",
    "    if S == 1: #для случаев s = 10^n\n",
    "        return 10, 2\n",
    "    return S + 1, S #B = S + 1; X = S\n",
    "\n",
    "captcha(\"9\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
